In [52]:
import pandas as pd
import numpy as np

In [15]:
pd= pd.DataFrame({
    'a': [10,20,30],
    'b': [20,30,40]
})

In [16]:
pd

    a   b
0  10  20
1  20  30
2  30  40

In [20]:
pd['a'].apply(np.mean)

0    10.0
1    20.0
2    30.0
Name: a, dtype: float64

In [25]:
def my_exp(a):
    return np.mean(a)

In [27]:
pd.apply(my_exp)

a    20.0
b    30.0
dtype: float64

In [29]:
def avg_mod(x,y):
    if(x==20):
        return np.NaN
    else:
        return (x +y)/2

In [30]:
avg_2_mod_vec=np.vectorize(avg_mod)

In [32]:
avg_2_mod_vec(pd['a'], pd['b'])

array([15., nan, 35.])

In [33]:
@np.vectorize
def avg_mod(x,y):
    if(x==20):
        return np.NaN
    else:
        return (x +y)/2

In [34]:
avg_mod(pd['a'], pd['b'])

array([15., nan, 35.])

In [64]:
#Exercise
@np.vectorize
def extrct(rate):
    pop= rate.split('/')[1]
    return int(pop)

In [65]:
assert extrct('123/456') == 456

In [66]:
tbl3= pd.read_csv('../data/table3.csv')

In [67]:
tbl3.head()

       country  year               rate
0  Afghanistan  1999       745/19987071
1  Afghanistan  2000      2666/20595360
2       Brazil  1999    37737/172006362
3       Brazil  2000    80488/174504898
4        China  1999  212258/1272915272

In [69]:
tbl3['pop']=tbl3['rate'].apply(extrct)

In [70]:
tbl3.head()

       country  year               rate         pop
0  Afghanistan  1999       745/19987071    19987071
1  Afghanistan  2000      2666/20595360    20595360
2       Brazil  1999    37737/172006362   172006362
3       Brazil  2000    80488/174504898   174504898
4        China  1999  212258/1272915272  1272915272